--- 
title: "通向R地狱之路"
author: "Patrick Burns"
site: bookdown::bookdown_site
output: bookdown::gitbook
documentclass: book
github-repo: rstudio/bookdown-demo
fontsize: 14pt
geometry: "left=3cm, right=3cm, top=2cm, bottom=2cm"
---
# 前言
## 摘要
如果你正在使用R,并且发觉自己正身处地狱之中,本书可以提供一份指南

### 游荡
http://www.r-project.org.

为了陈述我在那儿发现的美好,我也会说出其他看到的东西.

离开正途后,我陷入了沉睡,醒来时发现自己在一片黑暗的森林中.我试图逃离这片森林,但我的路被一只狮子挡住了.当我逃向低处时,一个身影出现在我面前.“无论你是阴影还是活人,请怜悯我,”我哭喊道.

“我曾是人,但现在不是.我父母来自伦巴第.我生于凯撒统治时期,生活在一个充满虚假神明的罗马.”

“你是维吉尔,那位伟大的诗人吗？”

“我认为你最好跟随我.我将带你穿越一个永恒之地,在那里你将听到绝望的哭喊,看到那些古老的灵魂在第二次死亡中痛苦地哀悼.”

经过一段旅程,我们来到一个拱门前.上面刻着：“通过我,进入受苦之城的道路,通过我,走向迷失之人的道路.”我们穿过了拱门.

此刻,叹息和哀号在无星的空气中回荡,我也开始哭泣.陌生的语言,可怕的口音,愤怒的哭喊——所有这些在那黑暗无尽的空气中旋转.

